In [2]:
import numpy as np 
import pandas as pd

### READING DATA USING PANDAS

We use pandas read.csv function to read the csv file in python and pandas DataFrame method to convert file into data frame.

In [4]:
titanic=pd.DataFrame(pd.read_csv("/content/train (1).csv"))
titanic.shape #returns no.of rows and columns

(891, 12)

In [34]:
titanic #Let's look into the titanic data

     PassengerId  Survived  Pclass  ... Embarked  family  Alone
0              1         0       3  ...        S       1      0
1              2         1       1  ...        C       1      0
2              3         1       3  ...        S       0      1
3              4         1       1  ...        S       1      0
4              5         0       3  ...        S       0      1
..           ...       ...     ...  ...      ...     ...    ...
886          887         0       2  ...        S       0      1
887          888         1       1  ...        S       0      1
888          889         0       3  ...        S       3      0
889          890         1       1  ...        C       0      1
890          891         0       3  ...        Q       0      1

[891 rows x 11 columns]

In [7]:
titanic.tail() #returns last 5 rows of titanic

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [33]:
titanic.head() #returns 1st 5 rows of titanic

   PassengerId  Survived  Pclass  ... Embarked  family  Alone
0            1         0       3  ...        S       1      0
1            2         1       1  ...        C       1      0
2            3         1       3  ...        S       0      1
3            4         1       1  ...        S       1      0
4            5         0       3  ...        S       0      1

[5 rows x 11 columns]

### handling null values

In [8]:
titanic.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [9]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
y=titanic.isnull().sum()
drop_column=y[y>(60/100*titanic.shape[0])]
drop_column

Cabin    687
dtype: int64

In [14]:
titanic.shape[1]

12

In [15]:
drop_column.index

Index(['Cabin'], dtype='object')

In [17]:
titanic.drop(drop_column.index,axis=1,inplace=True)
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [18]:
titanic.fillna(titanic.mean(),inplace=True)
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [19]:
titanic['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [20]:
titanic['Embarked'].fillna("S",inplace=True)
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [21]:
titanic.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

Pclass has more correlation with Survived(negative correlation), which implies Pclass1 has more survival rate.

In [25]:
titanic['family']= titanic['SibSp'] + titanic['Parch']
titanic.drop(['SibSp','Parch'],axis=1,inplace = True)
titanic.corr()

             PassengerId  Survived    Pclass       Age      Fare    family
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500  0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566 -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000  0.217138
family         -0.040143  0.016639  0.065997 -0.248512  0.217138  1.000000

family has more correlation with Fare. Hence as family size increases fare also increases.

In [26]:
titanic['Alone'] = [0 if titanic['family'][i]>0 else 1 for i in titanic.index]
titanic.head()

   PassengerId  Survived  Pclass  ... Embarked family  Alone
0            1         0       3  ...        S      1      0
1            2         1       1  ...        C      1      0
2            3         1       3  ...        S      0      1
3            4         1       1  ...        S      1      0
4            5         0       3  ...        S      0      1

[5 rows x 11 columns]

In [27]:
titanic.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

It shows if the person is alone, then the chance of survival is less. The reason might be the person who is traveling with his family might be belonging to rich class.

In [29]:
titanic[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [ ]:
Here it is negative correlation. It shows if the person is alone, fare will be less.

In [31]:
titanic['Sex'] = [0 if titanic["Sex"][i] == 'male' else 1 for i in titanic.index] #1 for female, 0 for male
titanic.groupby(['Sex'])["Survived"].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows female passengers have more chance of survival than male passengers.

In [32]:
titanic.groupby(['Embarked'])["Survived"].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

It shows persons who have embarkation port as  Cherbourg have more survival rate.

###**CONCLUSION**

- People in higher class have more survival rate than people in lower classes.
-As family size increases, fare also increases.
- If the person is alone, he has less chance of surviving. The reason might be the person who is traveling with his family might be belonging to rich class
- Female passengers have more chance of surviving than male ones. Female passengers were prioritized over man.
-  persons who have embarkation port as Cherbourg have more survival rate.